class AppStrings {
  AppStrings._();

  ///: <<<<<<======🗄️🗄️🗄️🗄️🗄️🗄️💡💡Home Page💡💡🗄️🗄️🗄️🗄️🗄️🗄️🗄️>>>>>>>>===========
  static const alHadith = "আল হাদিস";
  static const sobHadith = "সব হাদিসের বই";
  static const sorboses = "সর্বশেষ";
  static const aps = "অ্যাপস";
  static const hadiseJan = "হাদিসে যান";
  static const sodaka = "সদাকা";
  static const hadith = "হাদিস";
  static const sosongthitohadith = "[১০০ সুসংগঠিত হাদিস]";



}


//"তিনিও বললেন, রাসুলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম) বলেছিলেন, "আমি তোমাদেরকে খবর দিয়ারত করতে নিবদ্ধ করেছিলাম এখন তোমরা উহার হিয়ারত করো!" (মুসলিম ৯৭৭)
//
// [১০০ সুসাম্ব হাদিস]

//সব হাদিসের বই
//
// সাহিহ বুখারি
// ইমাম বুখারি
// ৭৫৬৩ হাদিস
//
// সাহিহ মুসলিম
// ইমাম মুসলিম
// ৯৪৫৩ হাদিস
//
// সুন্নে আন-নাসাই
// ৭৬৫৪ হাদিস